Autodesk.Revit.DB.InventorLink.HasInventorLinkAppInfo(Autodesk.Revit.DB.Document)
Checks whether an ADocument has InventorLinkAppInfo added.
Returns:
True if an ADocument has InventorLinkAppInfo added, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.InventorLink.GetTranslationInfo(Autodesk.Revit.DB.Document)
Retrieves "TranslationInfo" from the InventorLinkAppInfo.
ADoc:
ADocument that contains InventorLinkAppInfo.
Returns:
Returns the serialized XML data that contains snapshot stream, model service settings
and other data related to the translation (named "TranslationInfo" in ATFRevitRCE Host/Broker).
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input ADocument has no InventorLinkAppInfo added.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.InventorLink.SetTranslationInfo(Autodesk.Revit.DB.Document,System.String)
Sets "TranslationInfo" to the InventorLinkAppInfo.
ADoc:
ADocument that contains InventorLinkAppInfo.
translationInfo:
The serialized XML data that contains snapshot stream, model service settings
and other data related to the translation (named "TranslationInfo" in ATFRevitRCE Host/Broker).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.InventorLink
This class contains methods that can set the serialized XML data named
"TranslationInfo" to the InventorLinkAppInfo from the ATFRevitRCE Host/Broker
and can retrieve the "TranslationInfo" that is stored in the InventorLinkAppInfo.
Since:
2022